{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"wv2_spec_layer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2046"}, {"size": "256"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/wv2_spec_layer/Maximum/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/random_normal/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/zeros_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/add_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2046"}, {"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/hann_window/sub_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/rfft/fft_length", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/truediv_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_3_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1025"}, {"size": "256"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/random_normal/shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/random_normal/RandomStandardNormal", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_1", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/random_normal/RandomStandardNormal", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_1", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/strided_slice", "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/add", "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/StridedSlice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/truediv", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/zeros_like", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/ones_like"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/StridedSlice", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/Reshape", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/add_1", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/GatherV2", "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/Reshape_3", "StatefulPartitionedCall/model/wv2_spec_layer/stft/hann_window/sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/rfft", "op": "RFFT", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/mul", "StatefulPartitionedCall/model/wv2_spec_layer/stft/rfft/fft_length"], "attr": {"Treal": {"type": "DT_FLOAT"}, "Tcomplex": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Abs", "op": "ComplexAbs", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/stft/rfft"], "attr": {"Tout": {"type": "DT_FLOAT"}, "T": {"type": "DT_COMPLEX64"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/pow", "op": "Square", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Maximum/x", "StatefulPartitionedCall/model/wv2_spec_layer/pow"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Log", "op": "Log", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Log", "StatefulPartitionedCall/model/wv2_spec_layer/truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Max", "op": "Max", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/mul", "StatefulPartitionedCall/model/wv2_spec_layer/Const_2"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Max", "StatefulPartitionedCall/model/wv2_spec_layer/sub_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Maximum_2", "op": "Maximum", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/mul", "StatefulPartitionedCall/model/wv2_spec_layer/sub_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Maximum_2", "StatefulPartitionedCall/model/wv2_spec_layer/sub_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/truediv_3", "op": "Mul", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/sub_2", "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_3_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/truediv_3", "unknown"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}, "grad_a": {"b": false}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/wv2_spec_layer/Tensordot/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/wv2_spec_layer/Maximum/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/random_normal/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/zeros_like", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/ones_like", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/add_1", "shape": [2046, 4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/frame/concat_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/hann_window/sub_2", "shape": [2048], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/stft/rfft/fft_length", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/truediv_1", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/Const_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/wv2_spec_layer/sub_2/y", "shape": [], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/wv2_spec_layer/truediv_3_recip", "shape": [], "dtype": "float32"}, {"name": "unknown", "shape": [1025, 256], "dtype": "float32"}]}]}