{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "513"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "513"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/DEC/tf.split_3/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_11/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "513"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_11/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "513"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/tf.clip_by_value/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.clip_by_value/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/tf.concat_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/tf.compat.v1.transpose_5/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/tf.split_4/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/conv2d_transpose/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "768"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/conv2d_transpose/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "768"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_9/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_5/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_10/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/conv2d_transpose/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "768"}, {"size": "768"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/conv2d_transpose/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/conv2d_transpose/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_9/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_9/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_8/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_8/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_7/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_6/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_6/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_7/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "768"}, {"size": "768"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_7/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_3/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_8/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_12/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "513"}]}}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_12/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "513"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.clip_by_value_1/clip_by_value/Minimum/y", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/tf.clip_by_value_1/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/tf.concat_4/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC/tf.compat.v1.transpose_6/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_4", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_6/Cast", "op": "Cast", "input": ["input_4"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_6/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC/conv2d_6/Cast", "StatefulPartitionedCall/DEC/conv2d_6/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_HALF"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-15"}, {"size": "-14"}, {"size": "-16"}, {"size": "-17"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "768"}]}]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_6/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC/conv2d_6/Conv2D", "StatefulPartitionedCall/DEC/conv2d_6/BiasAdd/Cast"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-15"}, {"size": "-14"}, {"size": "-16"}, {"size": "768"}]}, {"dim": [{"size": "768"}]}]}}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/conv2d_6/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/add_noise/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/add_noise/Shape", "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack", "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack_1", "StatefulPartitionedCall/DEC/add_noise/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/add_noise/strided_slice", "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/1", "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/2", "StatefulPartitionedCall/DEC/add_noise/random_normal/shape/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC/add_noise/random_normal/shape"], "attr": {"T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise/Cast", "StatefulPartitionedCall/DEC/add_noise/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/conv2d_6/BiasAdd", "StatefulPartitionedCall/DEC/add_noise/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_15/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC/add_noise/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-19"}, {"size": "-14"}, {"size": "64"}, {"size": "768"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_15/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise/add", "StatefulPartitionedCall/DEC/tf.nn.silu_15/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_7/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_15/mul_1", "StatefulPartitionedCall/DEC/conv2d_7/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-19"}, {"size": "-14"}, {"size": "64"}, {"size": "768"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "768"}, {"size": "768"}]}]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_7/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC/conv2d_7/Conv2D", "StatefulPartitionedCall/DEC/conv2d_7/BiasAdd/Cast"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-19"}, {"size": "-14"}, {"size": "32"}, {"size": "768"}]}, {"dim": [{"size": "768"}]}]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/add_noise_1/Shape", "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack", "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack_1", "StatefulPartitionedCall/DEC/add_noise_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/add_noise_1/strided_slice", "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/1", "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/2", "StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC/add_noise_1/random_normal/shape"], "attr": {"dtype": {"type": "DT_HALF"}, "seed": {"i": "0"}, "seed2": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_1/Cast", "StatefulPartitionedCall/DEC/add_noise_1/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/conv2d_7/BiasAdd", "StatefulPartitionedCall/DEC/add_noise_1/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_16/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC/add_noise_1/add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-21"}, {"size": "-14"}, {"size": "32"}, {"size": "768"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_16/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_1/add", "StatefulPartitionedCall/DEC/tf.nn.silu_16/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_8/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_16/mul_1", "StatefulPartitionedCall/DEC/conv2d_8/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-21"}, {"size": "-14"}, {"size": "32"}, {"size": "768"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "768"}, {"size": "512"}]}]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_8/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC/conv2d_8/Conv2D", "StatefulPartitionedCall/DEC/conv2d_8/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-21"}, {"size": "-14"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/conv2d_8/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/add_noise_2/Shape", "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack", "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack_1", "StatefulPartitionedCall/DEC/add_noise_2/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/add_noise_2/strided_slice", "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/1", "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/2", "StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC/add_noise_2/random_normal/shape"], "attr": {"dtype": {"type": "DT_HALF"}, "seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_2/Cast", "StatefulPartitionedCall/DEC/add_noise_2/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/conv2d_8/BiasAdd", "StatefulPartitionedCall/DEC/add_noise_2/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_17/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC/add_noise_2/add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-23"}, {"size": "-14"}, {"size": "16"}, {"size": "512"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_17/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_2/add", "StatefulPartitionedCall/DEC/tf.nn.silu_17/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_9/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_17/mul_1", "StatefulPartitionedCall/DEC/conv2d_9/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-23"}, {"size": "-14"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_9/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC/conv2d_9/Conv2D", "StatefulPartitionedCall/DEC/conv2d_9/BiasAdd/Cast"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-23"}, {"size": "-14"}, {"size": "8"}, {"size": "256"}]}, {"dim": [{"size": "256"}]}]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/add_noise_3/Shape", "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack", "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack_1", "StatefulPartitionedCall/DEC/add_noise_3/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/add_noise_3/strided_slice", "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/1", "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/2", "StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC/add_noise_3/random_normal/shape"], "attr": {"dtype": {"type": "DT_HALF"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_3/Cast", "StatefulPartitionedCall/DEC/add_noise_3/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/conv2d_9/BiasAdd", "StatefulPartitionedCall/DEC/add_noise_3/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_18/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC/add_noise_3/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "8"}, {"size": "256"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_18/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_3/add", "StatefulPartitionedCall/DEC/tf.nn.silu_18/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_18/mul_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/Shape", "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/1", "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/2", "StatefulPartitionedCall/DEC/conv2d_transpose_1/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/stack", "StatefulPartitionedCall/DEC/conv2d_transpose_1/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC/tf.nn.silu_18/mul_1"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_HALF"}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/conv2d_transpose", "StatefulPartitionedCall/DEC/conv2d_transpose_1/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/add_noise_6/Shape", "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack", "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack_1", "StatefulPartitionedCall/DEC/add_noise_6/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/add_noise_6/strided_slice", "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/1", "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/2", "StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC/add_noise_6/random_normal/shape"], "attr": {"dtype": {"type": "DT_HALF"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_6/Cast", "StatefulPartitionedCall/DEC/add_noise_6/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/add_noise_6/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_1/BiasAdd", "StatefulPartitionedCall/DEC/add_noise_6/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_21/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC/add_noise_6/add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/tf.nn.silu_21/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC/add_noise_6/add", "StatefulPartitionedCall/DEC/tf.nn.silu_21/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_21/mul_1"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/tf.__operators__.add_19/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC/tf.nn.silu_21/mul_1", "StatefulPartitionedCall/DEC/tf.nn.silu_17/mul_1"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_4/Shape", "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC/tf.__operators__.add_19/AddV2"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/DEC/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_2/Shape", "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack", "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack_1", "StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_4/stack", "StatefulPartitionedCall/DEC/conv2d_transpose_4/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC/tf.nn.silu_21/mul_1"], "attr": {"T": {"type": "DT_HALF"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC/conv2d_transpose_2/strided_slice", "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/1", "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/2", "StatefulPartitionedCall/DEC/conv2d_transpose_2/stack/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": 