{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"input_6": {"name": "input_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "4"}, {"size": "64"}]}}}, "outputs": {"tf.cast_7": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "128"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/DEC2/tf.split_8/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/conv2d_transpose/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "256"}, {"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/conv2d_transpose/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "384"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/conv2d_transpose/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "512"}, {"size": "640"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/conv2d_transpose/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "640"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_20/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_20/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_21/Conv2D/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "640"}, {"size": "640"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_21/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "640"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/BiasAdd/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_22/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_22/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/DEC2/cout/Conv2D/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/cout/BiasAdd/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_HALF"}, "value": {"tensor": {"dtype": "DT_HALF", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/DEC2/tf.concat_8/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_6", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "4"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_20/Cast", "op": "Cast", "input": ["input_6"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_20/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC2/conv2d_20/Cast", "StatefulPartitionedCall/DEC2/conv2d_20/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-11"}, {"size": "-12"}, {"size": "-13"}, {"size": "-14"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "768"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_HALF"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_20/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_20/Conv2D", "StatefulPartitionedCall/DEC2/conv2d_20/BiasAdd/Cast"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-11"}, {"size": "-12"}, {"size": "-13"}, {"size": "768"}]}, {"dim": [{"size": "768"}]}]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_20/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/Shape", "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_11/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/random_normal/shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_HALF"}, "seed": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/Cast", "StatefulPartitionedCall/DEC2/add_noise_11/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_11/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_20/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_11/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_33/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "4"}, {"size": "768"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_33/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_11/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_33/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_33/mul_1"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/Shape", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/strided_slice", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/1", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/2", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC2/tf.nn.silu_33/mul_1"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_6/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/conv2d_transpose", "StatefulPartitionedCall/DEC2/conv2d_transpose_6/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "1"}, {"size": "8"}, {"size": "640"}]}, {"dim": [{"size": "640"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/Shape", "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_12/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/random_normal/shape"], "attr": {"dtype": {"type": "DT_HALF"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "seed2": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/Cast", "StatefulPartitionedCall/DEC2/add_noise_12/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_12/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_6/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_12/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_34/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-17"}, {"size": "1"}, {"size": "8"}, {"size": "640"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_34/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_12/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_34/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_21/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_34/mul_1", "StatefulPartitionedCall/DEC2/conv2d_21/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-17"}, {"size": "1"}, {"size": "8"}, {"size": "640"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "640"}, {"size": "640"}]}]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_21/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_21/Conv2D", "StatefulPartitionedCall/DEC2/conv2d_21/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-17"}, {"size": "1"}, {"size": "8"}, {"size": "640"}]}, {"dim": [{"size": "640"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_21/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/Shape", "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_13/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape/3"], "attr": {"axis": {"i": "0"}, "N": {"i": "4"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/random_normal/shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/Cast", "StatefulPartitionedCall/DEC2/add_noise_13/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_13/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_21/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_13/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_35/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "1"}, {"size": "8"}, {"size": "640"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_35/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_13/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_35/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_35/mul_1"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/Shape", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/strided_slice", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/1", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/2", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC2/tf.nn.silu_35/mul_1"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_7/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/conv2d_transpose", "StatefulPartitionedCall/DEC2/conv2d_transpose_7/BiasAdd/Cast"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/Shape", "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_14/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/random_normal/shape"], "attr": {"seed2": {"i": "0"}, "dtype": {"type": "DT_HALF"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/Cast", "StatefulPartitionedCall/DEC2/add_noise_14/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_14/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_7/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_14/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_36/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_36/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_14/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_36/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_22/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_36/mul_1", "StatefulPartitionedCall/DEC2/conv2d_22/Conv2D/Cast"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "1"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_22/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_22/Conv2D", "StatefulPartitionedCall/DEC2/conv2d_22/BiasAdd/Cast"], "attr": {"data_format": {"s": "TkhXQw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_22/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/Shape", "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_15/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/random_normal/shape"], "attr": {"T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "seed": {"i": "0"}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/Cast", "StatefulPartitionedCall/DEC2/add_noise_15/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_15/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_22/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_15/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_37/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/add"], "attr": {"T": {"type": "DT_HALF"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-6"}, {"size": "1"}, {"size": "16"}, {"size": "512"}]}]}}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_37/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_15/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_37/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_37/mul_1"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/Shape", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/strided_slice", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/1", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/2", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC2/tf.nn.silu_37/mul_1"], "attr": {"use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_8/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/conv2d_transpose", "StatefulPartitionedCall/DEC2/conv2d_transpose_8/BiasAdd/Cast"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-6"}, {"size": "1"}, {"size": "32"}, {"size": "384"}]}, {"dim": [{"size": "384"}]}]}}, "T": {"type": "DT_HALF"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/Shape", "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_16/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/random_normal/shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/mul", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/Cast", "StatefulPartitionedCall/DEC2/add_noise_16/random_normal/RandomStandardNormal"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_16/add", "op": "AddV2", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_8/BiasAdd", "StatefulPartitionedCall/DEC2/add_noise_16/mul"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_38/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/add"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "1"}, {"size": "32"}, {"size": "384"}]}]}}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/tf.nn.silu_38/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/DEC2/add_noise_16/add", "StatefulPartitionedCall/DEC2/tf.nn.silu_38/Sigmoid"], "attr": {"T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/tf.nn.silu_38/mul_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_HALF"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_9/Shape", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_9/strided_slice", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/1", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/2", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_9/stack", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/conv2d_transpose/Cast", "StatefulPartitionedCall/DEC2/tf.nn.silu_38/mul_1"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_HALF"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/DEC2/conv2d_transpose_9/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_9/conv2d_transpose", "StatefulPartitionedCall/DEC2/conv2d_transpose_9/BiasAdd/Cast"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}, {"dim": [{"size": "256"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_HALF"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/DEC2/conv2d_transpose_9/BiasAdd"], "attr": {"T": {"type": "DT_HALF"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/DEC2/add_noise_17/Shape", "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack", "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack_1", "StatefulPartitionedCall/DEC2/add_noise_17/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape", "op": "Pack", "input": ["StatefulPartitionedCall/DEC2/add_noise_17/strided_slice", "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/1", "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/2", "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/DEC2/add_noise_17/random_normal/RandomStandardNormal", "op": "RandomStandardNormal", "input": ["StatefulPartitionedCall/DEC2/add_noise_17/random_normal/shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_HALF"}, "seed": {"i": 