{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}, "input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "outputs": {"continuous_noise_layer_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}, "continuous_noise_layer": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "383"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/truncated_normal/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastArgs", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/SelectV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "128"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/truncated_normal/TruncatedNormal", "op": "TruncatedNormal", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/truncated_normal/shape"], "attr": {"seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "seed": {"i": "0"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastTo", "op": "BroadcastTo", "input": ["input_2", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastArgs"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/truncated_normal/TruncatedNormal", "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastTo", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value", "op": "Maximum", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/Minimum", "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value", "input_1", "StatefulPartitionedCall/model/continuous_noise_layer/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastTo_1", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/concat", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastArgs"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastTo_1", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/sub_2", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/add_1", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1", "StatefulPartitionedCall/model/continuous_noise_layer/linspace/SelectV2"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/linspace/concat", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/stack", "StatefulPartitionedCall/model/continuous_noise_layer/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/Mean", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_1", "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_1/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/truediv", "shape": [1, 383, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/truncated_normal/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/Minimum/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/BroadcastArgs", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/ExpandDims_1/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/linspace/SelectV2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_2/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_3/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/continuous_noise_layer/strided_slice_4/stack_2", "shape": [3], "dtype": "int32"}]}]}